    {
        "index": "hssn0",
        "hssn0": "a,hassen|Hello! Welcome to adventurous, I´m Hassen and I will guide you through this tutorial on how to play adventurous. Press spacebar to continue|r",
        "hssn0r": "a|If you need any help and assistance later you can check out the gameguide found in the menu above or at adventurous.no/gameguide. All information provided in this tutorial can be found on the gameguide pages|r",
        "hssn0rr": "a|To start off; what can you do in adventurous?|r",
        "hssn0rrr": "a|The short answer is that it is up to you. You can chose between leveling up your skills, play minigames, go on adventures, complete quest or go around the world exploring.|r",
        "hssn0rrrr": "a|As you can imagine from the name of the game going on adventures is a big part of the game. The tutorial will descirbe adventures further in the adventure section|r",
        "hssn0rrrrr": "a|Remember that if you wish to replay the tutorial you can simply press the '?' button over the game screen.|r",
        "hssn0rrrrrr": "a|Further you can find much information in the gameguides. The link is located at the top of the page|Q",
        "hssn0rrrrrrQ": "a|First off. This tutorial has @steps. Do you want the complete the tutorial or skip it entirely? You can at any point exit the tutorial.|r",
        "hssn0rrrrrrQr": [
            "b|Yes Please|r1",
            "b|Screw that, let me explore|r2"
        ],
        "hssn0rrrrrrQrr1": "a|Good choice. Lets get started|r",
        "hssn0rrrrrrQrr1r": "a||end|setNextStep",
        "hssn0rrrrrrQrr2": "a|Well then. Good luck adventurer! Remember that you can retake the tutorial if you regret your decision. Head to west and speak to the sailor to travel for here. This will complete your tutorial.|r",
        "hssn0rrrrrrQrr2r": "b|Thank you and goodbye|end",

        "hssn1": "a,hassen|First topic is controls|r",
        "hssn1r": "a|To Walk Around simply use the arrow keys. Further you will be using e to enter building and w to talk to persons. You will see down in the left corner when you are able to do any of these actions|r",
        "hssn1rr": "a|Try using the controls and notice the changes in the action indicator located in the right bottom corner as you get close to buildings or characters.|r",
        "hssn1rrr": "a|Remember that when the action indicator isn't showing any actions then the building cannot be entered or the character isn't interested in talking at the moment|r",
        "hssn1rrrr": "a|To toggle attack mode press C key. You will notice that you draw your sword. Without attack mode enabled you won't be able to attack. Use the A key to attack|r",
        "hssn1rrrrr": "a|When you have attacked a orange bar will appear in the upper left corner. You have to wait for the orange bar to disappear to attack again|r",
        "hssn1rrrrrr": "a|Try out this controls and meet me to the east when you are finished|end|relocateHassen#.1440.1925",

        "hssn2": "a,hassen|Next step is to learn about the hud on the page|r",
        "hssn2r": "a|First up we have the inventory to your right. This is where you will se which items you have. Try hovering over the item and you will get item and price|r",
        "hssn2rr": "a|Next up we have the game log located above you. Here you will find all game messages you get|r",
        "hssn2rrr": "a|On your left side you have the sidebar. You will find skills levels, countdowns of skill activity, diplomacy relations and adventure data|r",
        "hssn2rrrr": "a|The adventure tab will have all the information about your current adventure. Countdown tab will have all the skill activity you do. Here is also all the locations you can do skill related acitivties except for trader|r",
        "hssn2rrrrr": "a|The next tab is the diplomacy. Diplomacy will increase or decrease if you trade items or go on an adventure. You will be notified when this happens. Bad diplomacy results in worse trading prices|r",
        "hssn2rrrrrr": "a|The last tab is the skill tab. Click on the different skills to see how far you are from the next level|r",
        "hssn2rrrrrrr": "a|At the top you will notice the hunger bar. This is a bar that shows your hunger from 0 - 100. When playing or doing actions your hunger will deplete.|r",
        "hssn2rrrrrrrr": "a|When hunger is at 0 you won't be able to do actions in the game or travel with pesr. Visit a tavern to eat which replenish your hunger bar. For more information about what you can eat visit tavern page at the gameguide page.|r",
        "hssn2rrrrrrrrr": "a|To the right of hunger bar you will find the health bar. In combat you might take damage and this will decrease. You will regenerate missing health over time.|r",
        "hssn2rrrrrrrrrr": "a|When reaching 0 health you will die and respawn and nearest town|r",
        "hssn2rrrrrrrrrrr": "a|In the right corner is the map. You will find both a local and a world map. You are located by a red dot. Characters are not shown on the map|r",
        "hssn2rrrrrrrrrrrr": "a|That is all you need to know about the hud, lets move on to next step|r",
        "hssn2rrrrrrrrrrrrr": "a||end|setNextStep",
        
        "hssn3": "a,hassen|Next step we will talk about skills and profiencies|r",
        "hssn3r": "a|Adventurous contains 4 different skills; farmer, miner, trader and warrior you can level up to max 44. You also have an adventurer skill which you can increase your respect by completing adventures.|r",
        "hssn3rr": "a|Farmer will grow crops And make food. Find one of the buildings like the first on the left in towhar or Krasnur. Miner will mine minerals And Smith weapons And armour. Find the mine building and smithy in golbak or snerpiir to begin.|r",
        "hssn3rrr": "a|Trader will have trader assigments to bring merchandise and warrior will train warriors and send them on missions.|r",
        "hssn3rrrr": "a|You will chose one profiency from those. It can be changed at any time in city Centre for 500 gold. Each skill chosen as a profiency will have certain advantages. Would you like me to list them?|Q",
        "hssn3rrrrQ": [
            "a|Yes please|r1",
            "a|No, I will look it up if I need it|r2"
        ],
        "hssn3rrrrQr1": "a|Farmer will get reduced bakery prices of 75 %|r",
        "hssn3rrrrQr1r": "a|Miner will get reduced prices at smithy by 20 % and repair prices at Kapys down by 30 %|r",
        "hssn3rrrrQr1rr": "a|Trader gets goods instead of gold when completing trader assignments|r",
        "hssn3rrrrQr1rrr": "a|If you have warrior as profiency your warrios can equip wujkin and frajrite weapons and armour|r",
        "hssn3rrrrQr1rrrr": "a|Check out gameguides if you forget the advantages|r",
        "hssn3rrrrQr1rrrrr": "a|Lets move on|r",
        "hssn3rrrrQr1rrrrrr": "a||end|setNextStep",
        "hssn3rrrrQr2": "a|Your choice. Lets move onto the next topic|r",
        "hssn3rrrrQr2r": "a||end|setNextStep",

        "hssn4": "a,hassen|Lets look through some buildings you will enter many times|r",
        "hssn4r": "a|First up we have the stockpile. This is the building where you can store your items|r|showBuilding.stockpile",
        "hssn4rr": "a|Next up you have the crops building where you can plant crops and get seed|r|showBuilding.crops",
        "hssn4rrr": "a|Next on the list is the mine where you will start minining for minerals|r|showBuilding.mine",
        "hssn4rrrr": "a|Next up is the merchant where you can trade items and also start trading assignments|r|showBuilding.merchant",
        "hssn4rrrrr": "a|Next up is the armycamp where you will train and manage your warriors|r|showBuilding.armycamp",
        "hssn4rrrrrr": "a|You will find a complete of all the buildings you can enter in the gameguides|r",
        "hssn4rrrrrrr": "a|Note that the controller interface located in the left bottom corner will showcase if you can enter a building|r",
        "hssn4rrrrrrrr": "a||end|setNextStep",

        "hssn5": "a,hassen|Lets meet some people you want to know about|r",
        "hssn5r": "a|First one is pesr. You can travel with his cart all around the world. You can locate him on the map with this sign|r",
        "hssn5rr": "a|Next on is sailor. Talk to him to travel with his boat. You can locate him on the map with thi sign|r",
        "hssn5rrr": "a|Lets move on. This is kapys. You can find him in Snerpiir or Golbak. He can help with repairs on your armour|r",
        "hssn5rrrr": "a|Sometimes your armour and weapons can break. See gameguides for more information|r",
        "hssn5rrrrr": "a|Last person is Harfen. Talk to him about to get artefacts. I don't think you need to more about that know|r",
        "hssn5rrrrrr": "a||end|setNextStep",

        "hssn6": "a,hassen|Next topic is daqlooons|r",
        "hssn6r": "a|Through out this world you will find daqloons that you can fight. When killing them you can pick up horns or scales|r",
        "hssn6rr": "a|Daqloons keep around one area. They will not leave thier area. When a daqloon has a health bar over its head it is hunting you.|r",
        "hssn6rrr": "a|An interface will appear with a daqloon logo and a direction where the daqloon is located|r",
        "hssn6rrrr": "a|Remember to keep an eye on your attack cooldown to not take free damage|r",
        "hssn6rrrrr": "a|When hitting daqloon the amount of damage you dealt will be displayed for a short time|r",
        "hssn6rrrrrr": "a|Head up north and I have caught a daqloon for you. You can inspect it on closer hold. Come back when you are ready to move on|end|setHuntedStatus",

        "hssn7": "a,hassen|Last topic in the tutorial is adventures|r",
        "hssn7r": "a|You can participate in adventures by entering adventure base located in Fansal-plains, Ter, Khanz, Hirtam or Pvitul|r",
        "hssn7rrr": "a|Remember that your profiency dictates what role you will get in adventures when joining.|r",
        "hssn7rrrr": "a|When participating in an adventure you will get requirements which all participants need to complete in order to start the adventure. You cannot change requirements.|r",
        "hssn7rrrrr": "a|When completing adventures you will get different rewards limited to adventures only. Head to gameguides to find list of the rewards|r",
    
        "hssnEx": "a,hassen|You have now finished the tutorial. To exit this island and enter the main world seek out the sailor at the harbour to the west|end",
        "hssnns": "a,hassen|Ready for the next step?|Q",
        "hssnnsQ": [
            "b|Yes|r1",
            "b|No, I need a repition of this step|r2"
        ],
        "hssnnsQr1": "a|Lets proceed then.|r",
        "hssnnsQr1r": "a||end|setNextStep",
        "hssnnsQr2": "a|No problem|r",
        "hssnnsQr2r": "a||end|checkStep"
    }